let allMusic = [
    {
        name: "معركة بدر",
        artist: "ملحمة النبي",
        img: "music-1",
        src: "music-1"
    },
    {
        name: "معركةأحد",
        artist: "ملحمة النبي",
        img: "music-2",
        src: "music-2"
    },
    {
        name: "اغتيال رجل من أقوى رجال التاريخ",
        artist: "ملحمة النبي",
        img: "music-3",
        src: "music-3"
    },
    {
        name: "الصحابي الذي نزل لاجله جبريل",
        artist: "ملحمة النبي",
        img: "music-4",
        src: "music-4"
    },
    {
        name: "معركة بئر معونه",
        artist: "ملحمة النبي",
        img: "music-5",
        src: "music-5"
    },
    {
        name: "معركة بني النضير",
        artist: "ملحمة النبي",
        img: "music-6",
        src: "music-6"
    },
    {
        name: "قصة سب رسول الله",
        artist: "ملحمة النبي",
        img: "music-7",
        src: "music-7"
    },
    {
        name: "معركة الخندق الجزء الأول",
        artist: "ملحمة النبي",
        img: "music-8",
        src: "music-8"
    },
    {
        name: "معركة الخندق الجزء الثاني",
        artist: "ملحمة النبي",
        img: "music-9",
        src: "music-9"
    },
    {
        name: "غزوة بني قريظة",
        artist: "ملحمة النبي",
        img: "music-10",
        src: "music-10"
    },
     {
        name: "جيش كامل ضد خمسة من الصحابة",
        artist: "ملحمة النبي",
        img: "music-11",
        src: "music-11"
    },
     {
        name: "غزوة الغابة",
        artist: "ملحمة النبي",
        img: "music-12",
        src: "music-12"
    },
     {
        name: "غزوة بني المصطلق",
        artist: "ملحمة النبي",
        img: "music-13",
        src: "music-13"
    },
     {
        name: "🔥 غزوة الحديبية  الجزء الاول",
        artist: "ملحمة النبي",
        img: "music-14",
        src: "music-14"
    },
     {
        name: "🔥 غزوة الحديبية  الجزء الثاني",
        artist: "ملحمة النبي",
        img: "music-15",
        src: "music-15"
    },
     {
        name: "🔥 غزوة الحديبية  الجزء الأخير",
        artist: "ملحمة النبي",
        img: "music-16",
        src: "music-16"
    },
     {
        name: "ما بعد الحديبية",
        artist: "ملحمة النبي",
        img: "music-17",
        src: "music-17"
    },
     {
        name: "اول مهاجرة من النساء",
        artist: "ملحمة النبي",
        img: "music-18",
        src: "music-18"
    },
     {
        name: "النبي يأدب قبائل العرب",
        artist: "ملحمة النبي",
        img: "music-19",
        src: "music-19"
    },
     {
        name: "سحر  رسول الله",
        artist: "ملحمة النبي",
        img: "music-20",
        src: "music-20"
    },
    
     {
        name: "غزوة خيبر الجزء الأول",
        artist: "ملحمة النبي",
        img: "music-22",
        src: "music-22"
    },
     {
        name: "غزوة خيبر الجزء الثاني",
        artist: "ملحمة النبي",
        img: "music-23",
        src: "music-23"
    },
     {
        name: "تسمم رسول الله",
        artist: "ملحمة النبي",
        img: "music-24",
        src: "music-24"
    },
     {
        name: "اغتيال رسول الله",
        artist: "ملحمة النبي",
        img: "music-25",
        src: "music-25"
    },
     {
        name: "جيوش الصحابة تغزوا قبائل نجد",
        artist: "ملحمة النبي",
        img: "music-26",
        src: "music-26"
    },
         {
        name: "عمرة القضاء",
        artist: "ملحمة النبي",
        img: "music-27",
        src: "music-27"
    },
         {
        name: "أعظم قائد عسكري في التاريخ",
        artist: "ملحمة النبي",
        img: "music-28",
        src: "music-28"
    },
         {
        name: "غزوة مؤتة",
        artist: "ملحمة النبي",
        img: "music-29",
        src: "music-29"
    },
         {
        name: "سرية ذات السلاسل",
        artist: "ملحمة النبي",
        img: "music-30",
        src: "music-30"
    },
         {
        name: "فتح مكة الجزء الأول",
        artist: "ملحمة النبي",
        img: "music-31",
        src: "music-31"
    },
         {
        name: "فتح مكة الجزء الثاني",
        artist: "ملحمة النبي",
        img: "music-32",
        src: "music-32"
    },
         {
        name: "غزوة حنين",
        artist: "ملحمة النبي",
        img: "music-33",
        src: "music-33"
    },
         {
        name: "الدبابات في عهد النبي",
        artist: "ملحمة النبي",
        img: "music-34",
        src: "music-34"
    },
             {
        name: "غزوة تبوك",
        artist: "ملحمة النبي",
        img: "music-35",
        src: "music-35"
    },
            
];